src/InformationRegisters/зд_АктуальнаяПлатформа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>зд_АктуальнаяПлатформа</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Платформа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.здПлатформы1С</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ЗД_ИнформационныеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЗД_ИнформационныеБазы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортКластера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортАгентаСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Платформа1С</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.здПлатформы1С</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерезапускКластера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПодключенияБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SQL_db</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SQLDBРабочие</v8:Type>
						<v8:Type>cfg:CatalogRef.SQLDBТестовые</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_КодРазрешения</Name>
					<Comment>При установленной блокировки в 1Сv8*</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_КаталогВременныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_ВремяОжиданияОтключения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_ПутьКRAC</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_РеглЗаданияИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_РеглЗаданияАктивность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдБазыТесты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьCF</Name>
					<Comment>SD-56883</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортАвтономногоСервера</Name>
					<Comment>SD-56883</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПолучателиУведомлений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отправлять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Хранилище</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Хранилище</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗД_Хранилища</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛогинХранилища</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПарольХранилища</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/АвтономныйСервер/Ext/Module.bsl
Функция СоздатьКонфигурационныйФайл_old(Версия1С ,ИмяБазы, КонфигурационныйФайл, Перезаписывать = Ложь, ПортАвтономногоСервера = 8314) Экспорт 
	Рез = "";
	Ковычка = Символ(34);
	
	Если Не Перезаписывать И ПроверитьНаличиеФайла(КонфигурационныйФайл) Тогда
		Рез = КонфигурационныйФайл;
	Иначе
		КодВозврата = Неопределено;  
		КодировкаЗаписи = "cp866"; 
		КодировкаЧтения = "cp866";   
		//Версия1С = Константы.АвтономныйСерверВерсия1С.Получить();
		ДанныеКластера = Константы.АвтономныйСерверДанныеКластера.Получить(); 
	
		КаталогВременныхФайлов = КаталогВременныхФайлов();
		ИмяБатФайла = "CreateConfig.bat";
		ПолноеИмяИмяБатФайла = КаталогВременныхФайлов + ИмяБатФайла;
		СтрПортАвтономногоСервера = СтрЗаменить(Строка(Число(ПортАвтономногоСервера)),Символы.НПП,"");
		
		БатФайл = Новый ТекстовыйДокумент;
		//БатФайл.ДобавитьСтроку("set v8=" + Версия1С);
		БатФайл.ДобавитьСтроку("set v8=" + Ковычка+Версия1С+Ковычка);
		БатФайл.ДобавитьСтроку("%v8%ibcmd.exe server config import --cluster-data=""" + ДанныеКластера + """ --name=" + ИмяБазы + " --port=" + СтрПортАвтономногоСервера + " --out="+КонфигурационныйФайл);
		БатФайл.Записать(ПолноеИмяИмяБатФайла, КодировкаЗаписи);
		
		ЗапуститьПриложение(ИмяБатФайла, КаталогВременныхФайлов, Истина, КодВозврата);	
				
	    Если КодВозврата = 0 Тогда
	        Рез = КонфигурационныйФайл;
			УдалитьФайлы(ПолноеИмяИмяБатФайла);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

Функция СоздатьКонфигурационныйФайл(Версия1С ,ИмяБазы, КонфигурационныйФайл, Перезаписывать = Ложь, ПортАвтономногоСервера = 8314) Экспорт 
	Рез = КонфигурационныйФайл;
	Ковычка = Символ(34);
	
	ПортАвтономногоСервера	=	?(не ЗначениеЗаполнено(ПортАвтономногоСервера),8314,ПортАвтономногоСервера);
	
	Перезаписывать = не ПроверитьНаличиеФайла(КонфигурационныйФайл);
	
	Если Перезаписывать Тогда
		КодВозврата = Неопределено;  
		КодировкаЗаписи = "cp866"; 				
		ДанныеКластера = Константы.АвтономныйСерверДанныеКластера.Получить(); 
	
		КаталогВременныхФайлов = КаталогВременныхФайлов();
		//КаталогВременныхФайлов = Объект.КаталогРазборки;
		
		ИмяБатФайла = "CreateConfig.bat";
		ПолноеИмяИмяБатФайла = КаталогВременныхФайлов +"\" + ИмяБатФайла;
		СтрПортАвтономногоСервера = СтрЗаменить(Строка(Число(ПортАвтономногоСервера)),Символы.НПП,"");
		
		МассивКомманд = Новый Массив;
		МассивКомманд.Добавить(Ковычка+Версия1С+Ковычка);
		МассивКомманд.Добавить("server config import");	
		МассивКомманд.Добавить("--cluster-data="+ДанныеКластера);
		МассивКомманд.Добавить("--name="+ИмяБазы);
		МассивКомманд.Добавить("--port="+СтрПортАвтономногоСервера);
		МассивКомманд.Добавить("--out="+КонфигурационныйФайл);
		
		стрКоманда = СтрСоединить(МассивКомманд," ");  
		ЗапуститьПриложение(стрКоманда,КаталогВременныхФайлов, Истина, КодВозврата);
		Сообщить("("+КодВозврата+")"+стрКоманда);
		Пауза(1);
		
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

Функция ПроверитьНаличиеФайла(ИмяФайла)Экспорт
	Рез = Ложь;
	МойФайл = Новый Файл(ИмяФайла);
	Рез = МойФайл.Существует(); 
	Возврат Рез;
КонецФункции    

Функция ОстановитьИсполнение()
	
	Если Константы.ОстановитьИсполнение.Получить() = Истина Тогда
		
		ТекстСообщения = "Выполнение остановлено пользователем через константу";
		ЗаписьЖурналаРегистрации("Обновление из хранилища",,,,ТекстСообщения);
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура Пауза(Секунд) Экспорт
	
	Для к=1 По Секунд Цикл
		
		Если ОстановитьИсполнение() Тогда
			Прервать;
		КонецЕсли; 
		
		СтрокаЗапроса = "ping -n 2 localhost"; 
		Соединение = Новый COMОбъект("WScript.Shell");
		Соединение.Run(СтрокаЗапроса, 0, -1);	
		
	КонецЦикла;
	
КонецПроцедуры

Функция глПолучитьКаталог(Кат) экспорт
  Возврат ?(ПустаяСтрока(Кат)=0, ?(Прав(СОКРП(Кат),1)<>"\",СОКРЛП(Кат)+"\",СОКРЛП(Кат)),"");
КонецФункции

//Команды:
//export  - выгрузка в хмл
//sync - синхронизация файлов
//import - загрузка из хмл
//save - сохранить в cf
//load - загрузить из  cf
//apply - обновит конфигурацию базы данных (с выполнением, при необходимости, реструктуризации базы данных).
//dump - выгрузка dt   
//restore - восстановить
Процедура ВыполнитьСценарийАвтономногоСервера(ИнформационнаяБаза,Команда,знач РабочийКаталог,ИмяРасширения="") Экспорт
	
	Ковычка = Символ(34); 
	КодВозврата = "999";		    
	КодировкаЗаписи = "cp866";
	
	мНачалоСценария = ТекущаяДата(); 
	КомандаХМЛ = Новый Массив;
	КомандаХМЛ.Добавить("export");	
	КомандаХМЛ.Добавить("sync");
	КомандаХМЛ.Добавить("import"); 
	
	КомандаДТ = Новый Массив;
	КомандаДТ.Добавить("dump");	
	КомандаДТ.Добавить("restore");
	
	РабочийКаталог = глПолучитьКаталог(РабочийКаталог);
	
	ЭтоДТ_Команда = КомандаДТ.Найти(Команда)<>Неопределено;	
	ЭтоХМЛ_Команда = КомандаХМЛ.Найти(Команда)<>Неопределено;	
	
	Если не ПроверитьНаличиеФайла(РабочийКаталог) Тогда
		СоздатьКаталог(РабочийКаталог);
		ОбщегоНазначения.СообщитьПользователю(""+РабочийКаталог+" - создан!");
	КонецЕсли;   
	
	КаталогВыгрузкиXML = РабочийКаталог + "cfg_xml";	
	Если ЭтоХМЛ_Команда и 
		не ПроверитьНаличиеФайла(КаталогВыгрузкиXML) Тогда
		
		СоздатьКаталог(КаталогВыгрузкиXML);
		ОбщегоНазначения.СообщитьПользователю(""+КаталогВыгрузкиXML+" - создан!");		
	КонецЕсли;	
	
	РеквизитыИБ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИнформационнаяБаза,"ИмяБазы,ПортАвтономногоСервера,ЛогинБазы,ПарольБазы");	
	
	//Платформа
	ТекПлатформа = РегистрыСведений.зд_АктуальнаяПлатформа.ПолучитьПоследнее(ТекущаяДата()).Платформа;   
	Версия1С = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекПлатформа,"ПутьКПлатформе1С");
	Версия1С = СтрЗаменить(Версия1С,"1cv8.exe","ibcmd.exe");  
	
	ИмяФайла_ibcmd =  Команда+"_"+РеквизитыИБ.ИмяБазы;	
	ИмяБатФайла = ИмяФайла_ibcmd + ".bat";
	ИмяlogФайла = РабочийКаталог+ИмяФайла_ibcmd + ".log";
		
	ИмяФайла1С = РеквизитыИБ.ИмяБазы+?(ЭтоДТ_Команда,".dt",".cf");
		
	КонфигурационныйФайл = КаталогВременныхФайлов() + РеквизитыИБ.ИмяБазы + ".yml"; 		
	КонфигурационныйФайл = АвтономныйСервер.СоздатьКонфигурационныйФайл(Версия1С,РеквизитыИБ.ИмяБазы, КонфигурационныйФайл, Ложь, ?(РеквизитыИБ.ПортАвтономногоСервера=0,Неопределено,РеквизитыИБ.ПортАвтономногоСервера)); 
	
	Если НЕ ПроверитьНаличиеФайла(КонфигурационныйФайл) Тогда
		ОбщегоНазначения.СообщитьПользователю("(Отмена скрипта)не создан конф. файл: "+КонфигурационныйФайл);	
		Возврат;
	КонецЕсли;
	
	МассивКомманд = Новый Массив;
	МассивКомманд.Добавить(Ковычка+Версия1С+Ковычка);
	
	//БатФайл.ДобавитьСтроку("%v8% infobase dump -c " + КонфигурационныйФайл + " " + ПутьВыгрузки + "\" + ИмяБазы + "\1cv8.dt -u " + ЛогинБазы + " -P " + ПарольБазы);
	
	Если ЭтоДТ_Команда Тогда
		МассивКомманд.Добавить("infobase "+Команда);				
	Иначе		
		Если Команда="sync" Тогда
			МассивКомманд.Добавить("infobase config export");		
		Иначе
			МассивКомманд.Добавить("infobase config "+Команда);			
		КонецЕсли;			
	Конецесли;
		
	МассивКомманд.Добавить("--user="+РеквизитыИБ.ЛогинБазы);
	МассивКомманд.Добавить("--password="+РеквизитыИБ.ПарольБазы);
	
	Если Команда="sync" Тогда
		МассивКомманд.Добавить("--sync="+КонфигурационныйФайл);	
	КонецЕсли;
	
	МассивКомманд.Добавить("--config="+КонфигурационныйФайл);
	Если ЭтоХМЛ_Команда Тогда
		МассивКомманд.Добавить(КаталогВыгрузкиXML);
	Иначе
		МассивКомманд.Добавить(РабочийКаталог+ИмяФайла1С);		
	КонецЕсли; 
	
	Если Команда="apply" Тогда
		МассивКомманд.Добавить("--force");		
	КонецЕсли;
	
	МассивКомманд.Добавить(">"+ИмяlogФайла);
	
	стрКоманда = СтрСоединить(МассивКомманд," "); 	
	
	БатФайл = Новый ТекстовыйДокумент;	
	БатФайл.ДобавитьСтроку("echo off");
	БатФайл.ДобавитьСтроку(стрКоманда);
	БатФайл.Записать(РабочийКаталог+ИмяБатФайла, КодировкаЗаписи);
	ЗапуститьПриложение(ИмяБатФайла, РабочийКаталог, Истина, КодВозврата);
	Сообщить("("+КодВозврата+") Начало:"+мНачалоСценария+" - завершено: "+ТекущаяДата());	
	   
	//чтение логов  
	мТекстФайла="";
	Если ПроверитьНаличиеФайла(ИмяlogФайла) Тогда
		мТекстФайла = "";
		ТекстФайл = новый Файл(ИмяlogФайла);
		Если ТекстФайл.Существует() Тогда
			Текст = Новый ТекстовыйДокумент;	
			Текст.Прочитать(ИмяlogФайла,КодировкаТекста.UTF8);	
			мТекстФайла = Текст.ПолучитьТекст();
		КонецЕсли;
		Сообщить(""+ИмяlogФайла+": "+Символы.ПС+мТекстФайла);  
	КонецЕсли;    
	ЗаписьЖурналаРегистрации("АвтономныйСервер."+Команда,?(КодВозврата=0,УровеньЖурналаРегистрации.Информация,УровеньЖурналаРегистрации.Ошибка),Метаданные.Справочники.ЗД_ИнформационныеБазы,ИнформационнаяБаза,""+мНачалоСценария+"-"+ТекущаяДата()+" "+мТекстФайла);
	
		
КонецПроцедуры


Процедура СохранитьКонфигурацию(ИнформационнаяБаза = Неопределено) Экспорт
	
	////Версия1С = Константы.АвтономныйСерверВерсия1С.Получить(); 	
	Путь = Константы.АвтономныйСерверПутьКонфигурации.Получить();
	ПутьВыгрузки = Константы.АвтономныйСерверПутьВыгрузки.Получить();  
	
	ДеньВыгрузки = "_"+Строка(ДеньНедели(ТекущаяДата()));  //ДанилинВИ 24/02/25
	ТекПлатформа = РегистрыСведений.зд_АктуальнаяПлатформа.ПолучитьПоследнее(ТекущаяДата()).Платформа;    //ДанилинВИ 24/02/25
	Версия1С = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекПлатформа,"ПутьКПлатформе1С");
	Версия1С = СтрЗаменить(Версия1С,"1cv8.exe","ibcmd.exe");
	Ковычка = Символ(34); 
	
	Запрос = Новый Запрос;  
	Если ИнформационнаяБаза = Неопределено Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗД_ИнформационныеБазы.Ссылка КАК Ссылка,
			|	ЗД_ИнформационныеБазы.ИмяБазы КАК ИмяБазы,
			|	ЗД_ИнформационныеБазы.ЛогинБазы КАК ЛогинБазы,
			|	ЗД_ИнформационныеБазы.ПарольБазы КАК ПарольБазы,
			|	ЗД_ИнформационныеБазы.ПортАвтономногоСервера КАК ПортАвтономногоСервера
			|ИЗ
			|	Справочник.ЗД_ИнформационныеБазы КАК ЗД_ИнформационныеБазы
			|ГДЕ
			|	ЗД_ИнформационныеБазы.СохранятьCF = ИСТИНА";
	Иначе
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗД_ИнформационныеБазы.Ссылка КАК Ссылка,
			|	ЗД_ИнформационныеБазы.ИмяБазы КАК ИмяБазы,
			|	ЗД_ИнформационныеБазы.ЛогинБазы КАК ЛогинБазы,
			|	ЗД_ИнформационныеБазы.ПарольБазы КАК ПарольБазы,
			|	ЗД_ИнформационныеБазы.ПортАвтономногоСервера КАК ПортАвтономногоСервера
			|ИЗ
			|	Справочник.ЗД_ИнформационныеБазы КАК ЗД_ИнформационныеБазы
			|ГДЕ
			|	ЗД_ИнформационныеБазы.Ссылка = &ИнформационнаяБаза";
		Запрос.УстановитьПараметр("ИнформационнаяБаза", ИнформационнаяБаза);
	
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();  
	мПутьВыгрузки = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
		ИмяБазы = ВыборкаДетальныеЗаписи.ИмяБазы; //+"_"+ДеньВыгрузки; //ДанилинВИ 24/02/25
		ЛогинБазы = ВыборкаДетальныеЗаписи.ЛогинБазы;
		ПарольБазы = ВыборкаДетальныеЗаписи.ПарольБазы;
		ПортАвтономногоСервера = ВыборкаДетальныеЗаписи.ПортАвтономногоСервера;
		
		КодВозврата = Неопределено;  
		//КодировкаЗаписи = "cp866"; 
		КодировкаЗаписи = КодировкаТекста.UTF8;
		//КодировкаЧтения = "cp866";   
		
		КонфигурационныйФайл = Путь +"\" + ИмяБазы + ".yml"; 
		КонфигурационныйФайл = СоздатьКонфигурационныйФайл(Версия1С,ИмяБазы, КонфигурационныйФайл, Истина, ПортАвтономногоСервера); 
		
		Если ПустаяСтрока(КонфигурационныйФайл) Тогда
			Продолжить;
			ЗаписьЖурналаРегистрации("АвтономныйСервер.Ошибка.СохранитьКонфигурацию",УровеньЖурналаРегистрации.Ошибка,,ВыборкаДетальныеЗаписи.Ссылка,"Ошибка формирования файла конфигурации");	
		КонецЕсли;
		
		
		КаталогВременныхФайлов = КаталогВременныхФайлов();
		ИмяБатФайла = ИмяБазы + ".bat";
		ПолноеИмяИмяБатФайла = КаталогВременныхФайлов + ИмяБатФайла; 
		//ПолноеИмяИмяБатФайла = Путь + "\" + ИмяБатФайла;
		
		БатФайл = Новый ТекстовыйДокумент;
		//БатФайл.ДобавитьСтроку("chcp 65001");
        БатФайл.ДобавитьСтроку("echo off");
		//БатФайл.ДобавитьСтроку("set v8=" + Версия1С);
		БатФайл.ДобавитьСтроку("set v8=" + Ковычка+Версия1С+Ковычка); 
		Если Не ПроверитьНаличиеФайла(ПутьВыгрузки + "\" + ИмяБазы) Тогда
			БатФайл.ДобавитьСтроку("mkdir " + ПутьВыгрузки + "\" + ИмяБазы);	
		КонецЕсли;
		
		БатФайл.ДобавитьСтроку("%v8% infobase config save -c " + КонфигурационныйФайл + " " + ПутьВыгрузки + "\" + ИмяБазы+ДеньВыгрузки + "\Main.cf -u " + ЛогинБазы + " -P " + ПарольБазы);

		//БатФайл.ДобавитьСтроку("%v8%\ibcmd.exe infobase config save -c " + КонфигурационныйФайл + " " + ПутьВыгрузки + "\" + ИмяБазы+ДеньВыгрузки + "\Main.cf -u " + ЛогинБазы + " -P " + ПарольБазы);
		//БатФайл.ДобавитьСтроку("pause");
		БатФайл.Записать(ПолноеИмяИмяБатФайла, КодировкаЗаписи);
		ЗапуститьПриложение(ИмяБатФайла, КаталогВременныхФайлов, Истина, КодВозврата);	
		УдалитьФайлы(ПолноеИмяИмяБатФайла); 
		
		Если КодВозврата>0 Тогда
			
			Продолжить;
			ЗаписьЖурналаРегистрации("АвтономныйСервер.Ошибка.СохранитьКонфигурацию",УровеньЖурналаРегистрации.Ошибка,,ВыборкаДетальныеЗаписи.Ссылка,"Ошибка запуска бат-файла для выгрузки конфигурации");	
	
		КонецЕсли;
		
					
		ЗапросРасширений = Новый Запрос;
		ЗапросРасширений.Текст = 
			"ВЫБРАТЬ
			|	ЗД_Хранилища.Наименование КАК Наименование
			|ИЗ
			|	Справочник.ЗД_ИнформационныеБазы.Хранилище КАК ЗД_ИнформационныеБазыХранилище
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗД_Хранилища КАК ЗД_Хранилища
			|		ПО ЗД_ИнформационныеБазыХранилище.Хранилище = ЗД_Хранилища.Ссылка
			|ГДЕ
			|	ЗД_ИнформационныеБазыХранилище.Ссылка = &Ссылка
			|	И ЗД_Хранилища.ЭтоРасширение = ИСТИНА";
		
		ЗапросРасширений.УстановитьПараметр("Ссылка", ВыборкаДетальныеЗаписи.Ссылка);
		
		РезультатЗапросаРасширений = ЗапросРасширений.Выполнить();
		
		ВыборкаДетальныеЗаписиРасширений = РезультатЗапросаРасширений.Выбрать();
		
		Пока ВыборкаДетальныеЗаписиРасширений.Следующий() Цикл
			ИмяРасширения = ВыборкаДетальныеЗаписиРасширений.Наименование;  
			ИмяДляВыгрузки = ВыборкаДетальныеЗаписиРасширений.Наименование;
			ИмяБатФайла = ИмяБазы + ИмяДляВыгрузки + ".bat";
			ПолноеИмяИмяБатФайла = КаталогВременныхФайлов + ИмяБатФайла;
			//ПолноеИмяИмяБатФайла = Путь + "\" + ИмяБатФайла;
			БатФайл = Новый ТекстовыйДокумент;
			БатФайл.ДобавитьСтроку("chcp 65001");
	        БатФайл.ДобавитьСтроку("echo off");
			//БатФайл.ДобавитьСтроку("set v8=" + Версия1С);
			БатФайл.ДобавитьСтроку("set v8=" + Ковычка+Версия1С+Ковычка); 
			БатФайл.ДобавитьСтроку("%v8% infobase config save -c " + КонфигурационныйФайл + " -e " + ИмяРасширения + " " + ПутьВыгрузки + "\" + ИмяБазы+ДеньВыгрузки + "\" + ИмяДляВыгрузки + ".cfe -u " + ЛогинБазы + " -P " + ПарольБазы);
			//БатФайл.ДобавитьСтроку("pause");
			БатФайл.Записать(ПолноеИмяИмяБатФайла, КодировкаЗаписи);
			ЗапуститьПриложение(ИмяБатФайла, КаталогВременныхФайлов, Истина, КодВозврата);	
			УдалитьФайлы(ПолноеИмяИмяБатФайла);
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

Функция getcurrentpassword(nameib = "", nameuser = "") Экспорт
	
	res = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗД_ИнформационныеБазы.Ссылка КАК Ссылка,
		|	ЗД_ИнформационныеБазы.ПарольБазы КАК ПарольБазы
		|ИЗ
		|	Справочник.ЗД_ИнформационныеБазы КАК ЗД_ИнформационныеБазы
		|ГДЕ
		|	ЗД_ИнформационныеБазы.ИмяБазы = &ИмяБазы И
		|	ЗД_ИнформационныеБазы.ЛогинБазы = &ЛогинБазы";
	
	Запрос.УстановитьПараметр("ИмяБазы", nameib);
	Запрос.УстановитьПараметр("ЛогинБазы", nameuser);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		res = ВыборкаДетальныеЗаписи.ПарольБазы;
	КонецЦикла;
	
	Возврат res;
	
КонецФункции 

Функция setcurrentpassword(nameib = "", nameuser = "", password = "") Экспорт
	
	res = False;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗД_ИнформационныеБазы.Ссылка КАК Ссылка,
		|	ЗД_ИнформационныеБазы.ПарольБазы КАК ПарольБазы
		|ИЗ
		|	Справочник.ЗД_ИнформационныеБазы КАК ЗД_ИнформационныеБазы
		|ГДЕ
		|	ЗД_ИнформационныеБазы.ИмяБазы = &ИмяБазы И
		|	ЗД_ИнформационныеБазы.ЛогинБазы = &ЛогинБазы";
	
	Запрос.УстановитьПараметр("ИмяБазы", nameib);
	Запрос.УстановитьПараметр("ЛогинБазы", nameuser);

	
	РезультатЗапроса = Запрос.Выполнить(); 
	Если НЕ РезультатЗапроса.Пустой() Тогда
			
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если password = ВыборкаДетальныеЗаписи.ПарольБазы Тогда
			res = Истина; 
		Иначе
			Попытка
				СсылкаИБ = ВыборкаДетальныеЗаписи.Ссылка;
				ЭлементИБ = СсылкаИБ.ПолучитьОбъект();
				ЭлементИБ.ПарольБазы = password; 
				ЭлементИБ.Записать();
				res = Истина;
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
		
	КонецЕсли;
	
	Возврат res;
	
КонецФункции

Процедура СохранитьБазу(ИнформационнаяБаза = Неопределено) Экспорт
	
	Путь = Константы.АвтономныйСерверПутьКонфигурации.Получить();
	ПутьВыгрузки = Константы.АвтономныйСерверПутьВыгрузки.Получить();
	
	ТекПлатформа = РегистрыСведений.зд_АктуальнаяПлатформа.ПолучитьПоследнее(ТекущаяДата()).Платформа;    //ДанилинВИ 24/02/25
	Версия1С = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекПлатформа,"ПутьКПлатформе1С");
	Версия1С = СтрЗаменить(Версия1С,"1cv8.exe","ibcmd.exe");


	
	Запрос = Новый Запрос;  
	Если ИнформационнаяБаза = Неопределено Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЗД_ИнформационныеБазы.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ЗД_ИнформационныеБазы КАК ЗД_ИнформационныеБазы    
			|ГДЕ ЗД_ИнформационныеБазы.ИмяБазы=""ERP_work_report"" И НЕ ПометкаУдаления";
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			ИнформационнаяБаза = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
	КонецЕсли; 
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗД_ИнформационныеБазы.Ссылка КАК Ссылка,
		|	ЗД_ИнформационныеБазы.ИмяБазы КАК ИмяБазы,
		|	ЗД_ИнформационныеБазы.ЛогинБазы КАК ЛогинБазы,
		|	ЗД_ИнформационныеБазы.ПарольБазы КАК ПарольБазы,
		|	ЗД_ИнформационныеБазы.ПортАвтономногоСервера КАК ПортАвтономногоСервера
		|ИЗ
		|	Справочник.ЗД_ИнформационныеБазы КАК ЗД_ИнформационныеБазы
		|ГДЕ
		|	ЗД_ИнформационныеБазы.Ссылка = &ИнформационнаяБаза";
	Запрос.УстановитьПараметр("ИнформационнаяБаза", ИнформационнаяБаза);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
		ИмяБазы = ВыборкаДетальныеЗаписи.ИмяБазы;
		ЛогинБазы = ВыборкаДетальныеЗаписи.ЛогинБазы;
		ПарольБазы = ВыборкаДетальныеЗаписи.ПарольБазы;
		ПортАвтономногоСервера = ВыборкаДетальныеЗаписи.ПортАвтономногоСервера;
		
		КодВозврата = Неопределено;  
		//КодировкаЗаписи = "cp866"; 
		КодировкаЗаписи = КодировкаТекста.UTF8;
		//КодировкаЧтения = "cp866";   
		//Версия1С = Константы.АвтономныйСерверВерсия1С.Получить(); 
		КонфигурационныйФайл = Путь +"\" + ИмяБазы + ".yml"; 
		КонфигурационныйФайл = СоздатьКонфигурационныйФайл(Версия1С, ИмяБазы, КонфигурационныйФайл, Ложь, ПортАвтономногоСервера); 
	
		КаталогВременныхФайлов = КаталогВременныхФайлов();
		ИмяБатФайла = ИмяБазы + ".bat";
		ПолноеИмяИмяБатФайла = КаталогВременныхФайлов + ИмяБатФайла; 
		//ПолноеИмяИмяБатФайла = Путь + "\" + ИмяБатФайла;
		
		БатФайл = Новый ТекстовыйДокумент;
		//БатФайл.ДобавитьСтроку("chcp 65001");
        БатФайл.ДобавитьСтроку("echo off");
		БатФайл.ДобавитьСтроку("set v8=" + Версия1С); 
		Если Не ПроверитьНаличиеФайла(ПутьВыгрузки + "\" + ИмяБазы) Тогда
			БатФайл.ДобавитьСтроку("mkdir " + ПутьВыгрузки + "\" + ИмяБазы);	
		КонецЕсли;
		БатФайл.ДобавитьСтроку("%v8% infobase dump -c " + КонфигурационныйФайл + " " + ПутьВыгрузки + "\" + ИмяБазы + "\1cv8.dt -u " + ЛогинБазы + " -P " + ПарольБазы);
		//БатФайл.ДобавитьСтроку("pause");
		БатФайл.Записать(ПолноеИмяИмяБатФайла, КодировкаЗаписи);
		ЗапуститьПриложение(ИмяБатФайла, КаталогВременныхФайлов, Истина, КодВозврата);	
		УдалитьФайлы(ПолноеИмяИмяБатФайла);
					
	КонецЦикла;

КонецПроцедуры

Процедура ЗагрузитьБазу(ИнформационнаяБаза = Неопределено, ИсточникDT = "") Экспорт
	
	Путь = Константы.АвтономныйСерверПутьКонфигурации.Получить();
	ПутьВыгрузки = Константы.АвтономныйСерверПутьВыгрузки.Получить();

	
	Запрос = Новый Запрос;  
	Если ИнформационнаяБаза = Неопределено Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЗД_ИнформационныеБазы.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ЗД_ИнформационныеБазы КАК ЗД_ИнформационныеБазы    
			|ГДЕ ЗД_ИнформационныеБазы.ИмяБазы=""erp_etalon_autotest_pg"" И НЕ ПометкаУдаления";
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			ИнформационнаяБаза = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
	КонецЕсли; 
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗД_ИнформационныеБазы.Ссылка КАК Ссылка,
		|	ЗД_ИнформационныеБазы.ИмяБазы КАК ИмяБазы,
		|	ЗД_ИнформационныеБазы.ЛогинБазы КАК ЛогинБазы,
		|	ЗД_ИнформационныеБазы.ПарольБазы КАК ПарольБазы,
		|	ЗД_ИнформационныеБазы.ПортАвтономногоСервера КАК ПортАвтономногоСервера
		|ИЗ
		|	Справочник.ЗД_ИнформационныеБазы КАК ЗД_ИнформационныеБазы
		|ГДЕ
		|	ЗД_ИнформационныеБазы.Ссылка = &ИнформационнаяБаза";
	Запрос.УстановитьПараметр("ИнформационнаяБаза", ИнформационнаяБаза);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
		ИмяБазы = ВыборкаДетальныеЗаписи.ИмяБазы;
		ЛогинБазы = ВыборкаДетальныеЗаписи.ЛогинБазы;
		ПарольБазы = ВыборкаДетальныеЗаписи.ПарольБазы;
		ПортАвтономногоСервера = ВыборкаДетальныеЗаписи.ПортАвтономногоСервера;
		
		КодВозврата = Неопределено;  
		//КодировкаЗаписи = "cp866"; 
		КодировкаЗаписи = КодировкаТекста.UTF8;
		//КодировкаЧтения = "cp866";   
		Версия1С = Константы.АвтономныйСерверВерсия1С.Получить(); 
		КонфигурационныйФайл = Путь +"\" + ИмяБазы + ".yml"; 
		КонфигурационныйФайл = СоздатьКонфигурационныйФайл(ИмяБазы, КонфигурационныйФайл, Ложь, ПортАвтономногоСервера); 
	
		КаталогВременныхФайлов = КаталогВременныхФайлов();
		ИмяБатФайла = ИмяБазы + ".bat";
		ПолноеИмяИмяБатФайла = КаталогВременныхФайлов + ИмяБатФайла; 
		//ПолноеИмяИмяБатФайла = Путь + "\" + ИмяБатФайла;
		
		БатФайл = Новый ТекстовыйДокумент;
		//БатФайл.ДобавитьСтроку("chcp 65001");
	    БатФайл.ДобавитьСтроку("echo off");
		БатФайл.ДобавитьСтроку("set v8=" + Версия1С); 
		Если Не ПроверитьНаличиеФайла(ПутьВыгрузки + "\" + ИмяБазы) Тогда
			БатФайл.ДобавитьСтроку("mkdir " + ПутьВыгрузки + "\" + ИмяБазы);	
		КонецЕсли;
		//ИсточникDT = "\\office.local\1c\1cConfigs\erp_etalon_autotest2\1cv8.dt" 
		БатФайл.ДобавитьСтроку("%v8%\ibcmd.exe infobase restore -c " + КонфигурационныйФайл + " " + ИсточникDT + " -u " + ЛогинБазы + " -P " + ПарольБазы);
		//БатФайл.ДобавитьСтроку("pause");
		БатФайл.Записать(ПолноеИмяИмяБатФайла, КодировкаЗаписи);
		ЗапуститьПриложение(ИмяБатФайла, КаталогВременныхФайлов, Истина, КодВозврата);	
		УдалитьФайлы(ПолноеИмяИмяБатФайла);
		
		
		//ibcmd.exe infobase restore --user=ibuser --password=123 --dbms=mssqlserver --database-server=dbServerName --db-user=dbUser --database-password=dbUserPassword --database-name=docs-db --data="D:\ss-data\cs-data" --database-name=dbName .\1cv8.dt
	КонецЦикла;

КонецПроцедуры

Процедура ПолучитьФайлDataCompressionTool(ИнформационнаяБаза = Неопределено) Экспорт 
	Путь = Константы.АвтономныйСерверПутьКонфигурации.Получить();
	ПутьВыгрузки = Константы.АвтономныйСерверПутьВыгрузки.Получить();
	ПутьDatabaseCompressionTool = Константы.ПутьDatabaseCompressionTool.Получить();
	
	//<< Danilin.V 14.03.2025 ошибка DCT
	ТекПлатформа = РегистрыСведений.зд_АктуальнаяПлатформа.ПолучитьПоследнее(ТекущаяДата()).Платформа;   
	Версия1С = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекПлатформа,"ПутьКПлатформе1С");
	Версия1С = СтрЗаменить(Версия1С,"1cv8.exe","ibcmd.exe"); 		
	//Danilin.V>>//Платформа

	
	Запрос = Новый Запрос;  
	Если ИнформационнаяБаза <> Неопределено Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗД_ИнформационныеБазы.Ссылка КАК Ссылка,
			|	ЗД_ИнформационныеБазы.ИмяСервера КАК ИмяСервера,
            |   ЗД_ИнформационныеБазы.ПортКластера КАК ПортКластера,
			|	ЗД_ИнформационныеБазы.ИмяБазы КАК ИмяБазы,
			|	ЗД_ИнформационныеБазы.ЛогинБазы КАК ЛогинБазы,
			|	ЗД_ИнформационныеБазы.ПарольБазы КАК ПарольБазы,
			|	ЗД_ИнформационныеБазы.ПортАвтономногоСервера КАК ПортАвтономногоСервера
			|ИЗ
			|	Справочник.ЗД_ИнформационныеБазы КАК ЗД_ИнформационныеБазы
			|ГДЕ
			|	ЗД_ИнформационныеБазы.Ссылка = &ИнформационнаяБаза";
		Запрос.УстановитьПараметр("ИнформационнаяБаза", ИнформационнаяБаза);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
			ИмяБазы = ВыборкаДетальныеЗаписи.ИмяБазы;
			ЛогинБазы = ВыборкаДетальныеЗаписи.ЛогинБазы;
			ПарольБазы = ВыборкаДетальныеЗаписи.ПарольБазы;
			ПортАвтономногоСервера = ВыборкаДетальныеЗаписи.ПортАвтономногоСервера;
			
			КодВозврата = Неопределено;  
			//КодировкаЗаписи = "cp866"; 
			КодировкаЗаписи = КодировкаТекста.UTF8;
			//КодировкаЧтения = "cp866";   
			Версия1С = Константы.АвтономныйСерверВерсия1С.Получить(); 
			КонфигурационныйФайл = Путь +"\" + ИмяБазы + ".yml"; 
			КонфигурационныйФайл = СоздатьКонфигурационныйФайл(Версия1С,ИмяБазы, КонфигурационныйФайл, Ложь, ПортАвтономногоСервера); 
			
			Текст = Новый ЧтениеТекста(КонфигурационныйФайл, КодировкаТекста.UTF8); 
			
			ServerType="MS"; //Тип СУБД: MS (MS SQL), PG (PostgreSQL)
			ServerSQL=""; //Адрес сервера SQL
			BaseSQL=""; //Имя базы SQL
			UserSQL=""; //Имя пользователя SQL
			PasswordSQL=""; //Пароль пользователя SQL
			
			Сообщение = Новый СообщениеПользователю();
			ПрочитаннаяСтрока = Текст.ПрочитатьСтроку();
			Сообщение.Текст = ПрочитаннаяСтрока;
			Сообщение.Сообщить();
			СтрокаРазделителя = ":";  
			ИскатьВСтроке = Ложь;
			Пока ПрочитаннаяСтрока <> Неопределено Цикл
				ПрочитаннаяСтрока = Текст.ПрочитатьСтроку(); 
				Если ПрочитаннаяСтрока = "database:" Тогда
					ИскатьВСтроке = Истина;	
				ИначеЕсли ПрочитаннаяСтрока = "infobase:" Тогда
					ИскатьВСтроке = Ложь;
				КонецЕсли;
				Если ИскатьВСтроке Тогда
					СтрокиДанных = СтрРазделить(ПрочитаннаяСтрока, СтрокаРазделителя);
					Если СтрокиДанных.Количество() = 2 Тогда
						Если СтрокиДанных[0] = "  dbms" Тогда
							Если СтрокиДанных[1] <> " MSSQLServer" Тогда
								ServerType="PG";
							КонецЕсли;
						ИначеЕсли СтрокиДанных[0] = "  server" Тогда
							ServerSQL = СокрЛ(СтрокиДанных[1]); 
						ИначеЕсли СтрокиДанных[0] = "  name" Тогда
							BaseSQL = СокрЛ(СтрокиДанных[1]);
						ИначеЕсли СтрокиДанных[0] = "  user" Тогда
							UserSQL = СокрЛ(СтрокиДанных[1]);
						ИначеЕсли СтрокиДанных[0] = "  password" Тогда
							PasswordSQL = СокрЛ(СтрокиДанных[1]);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;  
		
			КаталогВременныхФайлов = КаталогВременныхФайлов();
			ИмяБатФайла = "DCT" + ИмяБазы + ".bat";
			ПолноеИмяИмяБатФайла = КаталогВременныхФайлов + ИмяБатФайла; 
			//ПолноеИмяИмяБатФайла = Путь + "\" + ИмяБатФайла;
			
			БатФайл = Новый ТекстовыйДокумент;
			//БатФайл.ДобавитьСтроку("chcp 65001");
	        БатФайл.ДобавитьСтроку("echo off");     
			//Параметры запуска базы 1С
			БатФайл.ДобавитьСтроку("set PlatformVersion=" + Версия1С); //Номер версии платформы
			Если ВыборкаДетальныеЗаписи.ПортКластера <> "" Тогда
				БатФайл.ДобавитьСтроку("set Server1C=" + ВыборкаДетальныеЗаписи.ИмяСервера+":"+ВыборкаДетальныеЗаписи.ПортКластера); //Адрес сервера 1С 
			Иначе 
				БатФайл.ДобавитьСтроку("set Server1C=" + ВыборкаДетальныеЗаписи.ИмяСервера); //Адрес сервера 1С 
			КонецЕсли;
			БатФайл.ДобавитьСтроку("set Base1C=" + ВыборкаДетальныеЗаписи.ИмяБазы); //Имя базы 1С
			БатФайл.ДобавитьСтроку("set User1C=" + ВыборкаДетальныеЗаписи.ЛогинБазы); //Имя пользователя 1С
			БатФайл.ДобавитьСтроку("set Password1C=" + ВыборкаДетальныеЗаписи.ПарольБазы); //Пароль пользователя 1С
			БатФайл.ДобавитьСтроку("set Path=" + ПутьDatabaseCompressionTool); //Полный путь до обработки без кириллических символов C:\DatabaseCompressionTool.epf
			//Параметры запуска базы SQL
			БатФайл.ДобавитьСтроку("set ServerType=" + ServerType); //Тип СУБД: MS (MS SQL), PG (PostgreSQL)
			БатФайл.ДобавитьСтроку("set ServerSQL=" + ServerSQL); //Адрес сервера SQL
			БатФайл.ДобавитьСтроку("set BaseSQL=" + BaseSQL); //Имя базы SQL
			БатФайл.ДобавитьСтроку("set UserSQL=" + UserSQL); //Имя пользователя SQL
			БатФайл.ДобавитьСтроку("set PasswordSQL=" + PasswordSQL); //Пароль пользователя SQL 
			//Основные параметры автоматической конвертации
			БатФайл.ДобавитьСтроку("set ConversionMode=MS"); //Режим конвертации: MS (Minimum Size), MP (Maximum Performance), MC (Maximum Consistency)
			БатФайл.ДобавитьСтроку("set ReductionDate=" + Формат(НачалоКвартала(ДобавитьМесяц(ТекущаяДата(), -3)), "ДФ=""ггггММдд""")); //Граница среза данных в формате YYYYMMDD
			////Дополнительные параметры автоматической конвертации
			БатФайл.ДобавитьСтроку("set ProcessRowsPerRequest=500000"); //Обрабатывать строк за запрос
			БатФайл.ДобавитьСтроку("set NumberOfRowsPerRemainingEntryDocument=50000"); //Количество строк в документе ввода остатков
			БатФайл.ДобавитьСтроку("set DeleteObjectVersions=Y"); //Удалять версии объектов (N - Нет, Y - Да)
			БатФайл.ДобавитьСтроку("set DeleteAttachedFiles=Y"); //Удалять прикрепленные файлы (N - Нет, Y - Да)
			БатФайл.ДобавитьСтроку("set UseExclusiveMode=Y"); //Использовать монопольный режим (N - Нет, Y - Да)
			БатФайл.ДобавитьСтроку("set BreakOnError=Y"); //Прерывать при ошибке (N - Нет, Y - Да)
			БатФайл.ДобавитьСтроку("set WriteProtocol=Y"); //Записывать протокол выполнения (N - Нет, Y - Да)
			БатФайл.ДобавитьСтроку("set UseTableLocks=N"); //Использовать табличные блокировки (N - Нет, Y - Да)
			БатФайл.ДобавитьСтроку("set AccountingRollUpAccounts=000"); //Номер бухгалтерского счета для свертки (Если есть планы счетов и Режим конвертации: MaximumConsistency)
			//"C:\Program Files\1cv8\%PlatformVersion%\bin\1cv8c.exe" ENTERPRISE /IBConnectionString "Srvr=""%Server1C%"";Ref=""%Base1C%"";" /N %User1C% /P %Password1C% /Execute "%Path%" /DisableStartupMessages /DisableStartupDialogs /c"DCT;ST=%ServerType%;SSQL=%ServerSQL%;BSQL=%BaseSQL%;USQL=%UserSQL%;PSQL=%PasswordSQL%;CM=%ConversionMode%;RDD=%ReductionDate%;ARA=%AccountingRollUpAccounts%;WP=%WriteProtocol%;PRPR=%ProcessRowsPerRequest%;NRPD=%NumberOfRowsPerRemainingEntryDocument%;DOV=%DeleteObjectVersions%;DAF=%DeleteAttachedFiles%;UEM=%UseExclusiveMode%;BE=%BreakOnError%;UTL=%UseTableLocks%;"
			БатФайл.ДобавитьСтроку("%PlatformVersion%\1cv8c.exe ENTERPRISE /IBConnectionString ""Srvr=""""%Server1C%"""";Ref=""""%Base1C%"""";"" /N %User1C% /P %Password1C% /Execute ""%Path%"" /DisableStartupMessages /DisableStartupDialogs /c""DCT;ST=%ServerType%;SSQL=%ServerSQL%;BSQL=%BaseSQL%;USQL=%UserSQL%;PSQL=%PasswordSQL%;CM=%ConversionMode%;RDD=%ReductionDate%;ARA=%AccountingRollUpAccounts%;WP=%WriteProtocol%;PRPR=%ProcessRowsPerRequest%;NRPD=%NumberOfRowsPerRemainingEntryDocument%;DOV=%DeleteObjectVersions%;DAF=%DeleteAttachedFiles%;UEM=%UseExclusiveMode%;BE=%BreakOnError%;UTL=%UseTableLocks%;""");
			//БатФайл.ДобавитьСтроку("pause");
			БатФайл.Записать(ПолноеИмяИмяБатФайла, КодировкаЗаписи);
			ЗапуститьПриложение(ИмяБатФайла, КаталогВременныхФайлов, Истина, КодВозврата);
			//УдалитьФайлы(ПолноеИмяИмяБатФайла);	
		КонецЦикла;  
	КонецЕсли;
	
КонецПроцедуры
